---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookTopDirn2
source: html/6e6aeb3f-d636-ace2-b2bf-d7cf30095bf3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookTopDirn2 Property

"Hook Angle Top"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpanhookTopDirn2 { get; }
```